<template>
    <div class="body">
   <div class="top">
       <Tabs value="name1">
        <TabPane label="引言" name="name1">
            <p class="sap">痛苦乏味的生活是漫长的，幸福多彩的人生是短暂的，不断斗的人生是漫长的，荒度无事的生活是短暂的，这取决于一个人站在什么样的立场来看待这个问题。在我看来，时间的长短并不重要，关键是要活的有意义、活的精彩，这或许是一个在任何人看来都无庸置疑的道理。每个人都希望自己的人生道路过得有意义，也都知道要为此付之以努力，但是到底什么样的人生能称的上有意义？
我认为一个人在世界上应该有自己不断追求的目标，有属于自己的自我追求和健康向上的人生规划，使自己的每一天都过得多姿多彩，丰富充实，你到底干了多少事不重要，重要的是你有没有实现自己的目标、追求和人生规划
我从小时侯懂事起,父母便不厌其烦的教我如何做人，如何学习；等到了年级我又懂得人要快乐，健康向上的生活。
人的生命只有一次，而且是短暂的几十年，在这短暂的几十年中，我们应该有一个乐观的心态，勇敢的面对一切艰辛与困难，无论遇到怎样的环境与事物，都要有一个微笑的心态；人要懂得放弃，懂得放弃现在自己所拥有的一切，这不是功亏一篑，这不是半途而废，这是为了获得更大的自我发展空间，获得一个真正属于自己的目标；不要盲目的最求时尚，独立思考和属于自己的个性生活更重要；要明白做任何事都要付出与其相同的代价，否则不会有一种成就感和一份满足，更不会有把自己之前所付出的代价“拿”回来的雄心；优势是你不会被自己表面的浅薄的亮点所耽搁，少花一些时间，少走一些弯，直接发现你内在的优势，直接挖掘自己深层的潜能。
要过上幸福美满的生活，就应该有明确的追求。人活着必须要有追求，如果没有追求，没有理想，没有目标，将会迷失自己，会活的很空虚，很迷茫，不知道自己为了什么而活着。
现在的我学习上有一定的压力，那便要追求快乐的学习，掌握学习的方法，学会学习。无论将来我的知识会有多么丰富、多么富足、么快乐，应该不断地努力学习，这不是为了获得第一的虚荣，而是人只要活着，就需要学习，因为快乐就在其中！我们应该注重追求的过程，而不只是最终的结果。就算我们在追求的过程中遇到了困难，要告诉自己：要坚强！要乐观！用微笑送走一切的困难，勇往直前。
诗人申宝峰曾说过：人生的道路有成千上万条，每一条都要它各自的风貌，路的好坏不在于崎岖多少 ，在于谁能最先达到目标。</p>
        </TabPane>
        <TabPane label="大学梦" name="name2">
            <Collapse v-model="value1">
        <Panel name="1" class="zi">
            大学一年级的目标
            <p slot="content">
                 <Steps :current="1">
        <Step title="学习" content="努力学好专业知识，加强计算机各项技能"></Step>
        <Step title="生活" content="加强锻炼，感恩，感知，爱生活"></Step>
        <Step title="思想" content="努力提高自己的思想觉悟,争取早日加入中国共产党"></Step>
        <Step title="未来" content="正在努力ing"></Step>
    </Steps>
            </p>
        </Panel>
        <Panel name="2" class="zi">
            大学二年级的目标
            <p slot="content" class="par">
              大二是提升技术的最佳时期，学习能力较强的时候，开学的两个星期里，自己研究做网站，用织梦的cms做的，懂得了什么是数据库，但是具体情况就不怎么清楚了，当时因为这个也很认真的学习，从早到晚都是学做网站，还经常跟朋友和同学说，自己会做网站了，当时很多同学都没有接触过做网站，所以就觉得我很厉害了，自己感觉到也十分自豪。几个星期后，学院创建了一个团队，是学技术的好地方，不过要经过面试，一开始，以为自己不行了， 但是没有想到的是自己装得很自信，很好学就这样自己进去了。从这以后，我再也没有怎样放松过，感觉自己就是在紧张的生活中度过一样，团队有很多规矩，像一个小公司，这里很有学习气氛，里面的事情发生的太多了，我就不一一讲了，总之。我学到了很多东西。包括java ， jquery ，javascript，ejb，strut，jsp，基本上javaweb的基础有接触过，但是都不是学得很好，都是皮毛，入门，其实自己很想提高，关键是交流，说不清楚自己想问什么，至今我的表达能力有待提高

   大学里，要学会交流，这是关键，不会交流的更加要努力了。大学在我看来，十分可贵，想想当初高三的时候自己多少个日夜，天天为了考上大学做奋斗，你就知道这个大学生活是怎样的来之不易的，一定要好好珍惜，多交几个知心朋友，多学点东西。每当看着那些整天打游戏的同学，我很想跟他们说点什么，但是有怕伤了和气，十分忐忑。作为一个立志成为开发人员来说，我要学习很多技术，不仅是javaweb开发方向的，还有其他的，都要了解下，因为这个社会竞争太激烈了。

      无论有多少感慨，时间总是不等人，留也留不住，少些对以前的抱怨，多些对未来的奋斗，我相信无论自己是什么，总有一天自己有自己的一片小天地，朋友，你为未来准备好了吗  ？

            </p>
        </Panel>
        <Panel name="3" class="zi">
           大学三年级的目标
            <p slot="content" class="par">蓦然回首，我曾为考不下证撕心裂肺的难受，但有时候事情发生了只有面对，没有其他的办法，就在一念间，沦落与振作，全在于自己把握。我一直在调整拥有一个好心态，保持微笑，可是没有对比就没有伤害，因为要强，常常因为身边的一些琐事影响心情，一直学不来所谓的坦然。因为没有办法做到不在乎、无所谓。但站在过去，我不敢想象这一生还能感受一次大学生活，我很庆幸。如果说大学三年我只能获取一个毕业证书，一无所获，我还是很感激我的大学，是它让我看清了：五湖四海的人聚集在这里，能力层次不齐的事实，不管处在哪里，都没有理由不努力，山外有山，人外有人。努力过哪怕失败了也没有遗憾，就怕该奋斗的年纪选择了安逸！我要试着做到：得之坦然，失之淡然。因为没有背景，没有后台，总把自己逼得有点失心疯，后来的我想通了，一生就这么短，没有比开心更重要，朝着自己的心走，为自己真正地活一次！能力不一样，起跑线不一样，结果怎么可能一样！人最大的敌人是自己，想要挑战的也是自己，争取在原有的基础上每天都进步一点点，都是一种收获。愿过去的迷茫与彷徨，都能够在大四的一年绽放出鲜艳的花朵!不管今后在哪里，都能够逼一逼自己，时刻都要努力。

</p>
        </Panel>
         <Panel name="4" class="zi">
           大学三年的收获
            <p slot="content" class="par">原来我一直都只在践行“成绩是万能的”这个伪真理。走出迷茫，需要历尽迷茫，前两年的选择，我从来没有后悔过，也一直不会后悔。人生本来就是一个过程，只有经历过才会懂得。如果现在大学可以重来一次，我想我仍然会如此选择。 大三，我逐渐拂去萦绕我心头的成绩和奖学金的阴霾，成绩只是表面上的东西，追逐学习的能力才是我们应该关注的东西。真正学习上的强者从来不担心自己的成绩，因为他们无需担心，试卷都装在他们的脑袋里，成绩绝不是可以拿来炫耀的东西，也绝对不是应该攀比的东西。对于同一场考试而言，不同学生的成绩根本就没有直接可比性，免去那些无谓的高傲或悲伤，无需关心别人的成绩，关心好自己的成绩就好，为自己每一次取得的进步而高兴。真正的强者从来都只会关注比现在的自己变得更强，奖学金是可遇而不可求的东西，奖学金从来都青睐有能力的学习者，绝不能单纯的为了奖学金而读书，因为在我的心里它不值得成为我学习的动力。</p>
        </Panel>
    </Collapse>
        </TabPane>
        <TabPane label="执梦远航" name="name3">
             <Row>
       
        <Col span="24" class="first">
       <Carousel autoplay v-model="value2" loop>
        <CarouselItem>
            <div class="demo-carousel">
                <img src="./images/bgc.jpg" alt="">
            </div>
        </CarouselItem>
        <CarouselItem>
            <div class="demo-carousel">
                 <img src="./images/true.jpg" alt="">
            </div>
        </CarouselItem>
        <CarouselItem>
            <div class="demo-carousel">
                 <img src="./images/false.jpg" alt="">
            </div>
        </CarouselItem>
        <CarouselItem>
            <div class="demo-carousel">
                 <img src="./images/banner.jpg" alt="">
            </div>
        </CarouselItem>
    </Carousel>
        </Col>
    </Row>
        </TabPane>
    </Tabs>
   </div>
   <BackTop :height="100" :bottom="100">
        <div class="top bot" style="border-radius:2px;background:rgba(0, 153, 229, .7);padding:10px;text-align:center;color:#fff">返回顶端</div>
    </BackTop>
    </div>

</template>
<script>


export default {
    methods: {
            success () {
                this.$Message.success('Welcome to here !');
            },
},
mounted(){
    this.success();
},
data () {
            return {
                value1: '1',
            
                  
                    autoplaySpeed: 6000,
                    
            
            }
        }
}
</script>
<style lang="stylus">
      .sap 
         font-size 24px
         line-height 34px
         text-indent 2em
       .ivu-tabs-nav .ivu-tabs-tab
        font-size 26px
       .demo-carousel img 
          width 100%
          height 650px
          .first
            width 100%
            height 300px
         .zi 
           font-size 25px
 
      .par 
          text-indent 2em!important
</style>


